---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDTop
source: html/0296a733-fd7c-c1e1-f3f4-e95800a70ed2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDTop Property

"D_Top"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamSpanSymDTop { get; }
```